jgrivera67/McRTOS/src/BoardSupport/LPC-54102/lpc54102_soc_hardware_abstractions.c
/**
 * @file lpc54102_soc_hardware_abstractions.c
 *
 * Hardware abstraction layer for the LPC54102 SoC
 *
 * @author German Rivera
 */

#include <BoardSupport/hardware_abstractions.h>
#include <BoardSupport/LPC-54102/lpc54102_soc.h>
#include <BoardSupport/LPC-54102/lpcxpresso_board.h>
#include <McRTOS/McRTOS_arm_cortex_m.h>
#include <McRTOS/failure_data_capture.h>
#include <McRTOS/utils.h>
#include <McRTOS/McRTOS_config_parameters.h>
#include <McRTOs/McRTOS_kernel_services.h>

#pragma GCC diagnostic ignored "-Wunused-local-typedefs"

/*
 * Disable compiler optimizations for this file, since it contains
 * timing sensitive functions
 */
#pragma GCC optimize "O0"

/**
 * Macro to generate dummy NVIC ISR functions
 */
#define GENERATE_DUMMY_NVIC_ISR_FUNCTION(_isr_function_name,                \
                                         _nvic_irq_number)                  \
        void                                                                \
        _isr_function_name(void)                                            \
        {                                                                   \
            /* This function should not have been invoked */                \
            FDC_ASSERT(false, _nvic_irq_number, 0);                         \
            FDC_ASSERT_INTERRUPT_SOURCE_IS_SET(_nvic_irq_number);           \
        }

/**
 * Serial communication parameters for the serial port used as the console
 * port
 */
#define CONSOLE_SERIAL_PORT_BAUD_RATE   115200
#define CONSOLE_SERIAL_PORT_MODE        0 /* default: 8-bits, no-parity, 1 stop bit */

static cpu_reset_cause_t find_reset_cause(void);

#ifdef _CPU_CYCLES_MEASURE_
static void init_cpu_clock_cycles_counter(void);
#endif

static void uart_stop(
    const struct uart_device *uart_device_p);

/*
 * Function prototypes for external interrupt ISRs
 */
static isr_function_t dummy_wdt_irq_isr;
static isr_function_t dummy_bod_irq_isr;
static isr_function_t dummy_reserved0_irq_isr;
static isr_function_t dummy_dma_irq_isr;
static isr_function_t dummy_gint0_irq_isr;
static isr_function_t dummy_pin_int0_irq_isr;
static isr_function_t dummy_pin_int1_irq_isr;
static isr_function_t dummy_pin_int2_irq_isr;
static isr_function_t dummy_pin_int3_irq_isr;
static isr_function_t dummy_utick_irq_isr;
static isr_function_t dummy_mrt_irq_isr;
static isr_function_t dummy_ct32b0_irq_isr;
static isr_function_t dummy_ct32b1_irq_isr;
static isr_function_t dummy_ct32b2_irq_isr;
static isr_function_t dummy_ct32b3_irq_isr;
static isr_function_t dummy_ct32b4_irq_isr;
static isr_function_t dummy_sct0_irq_isr;
static isr_function_t dummy_uart1_irq_isr;
static isr_function_t dummy_uart2_irq_isr;
static isr_function_t dummy_uart3_irq_isr;
static isr_function_t dummy_i2c0_irq_isr;
static isr_function_t dummy_i2c1_irq_isr;
static isr_function_t dummy_i2c2_irq_isr;
static isr_function_t dummy_spi0_irq_isr;
static isr_function_t dummy_spi1_irq_isr;
static isr_function_t dummy_adc_seqa_irq_isr;
static isr_function_t dummy_adc_seqb_irq_isr;
static isr_function_t dummy_adc_thcmp_irq_isr;
static isr_function_t dummy_rtc_irq_isr;
static isr_function_t dummy_reserved1_irq_isr;
static isr_function_t dummy_mailbox_irq_isr;
static isr_function_t dummy_int_gint1_irq_isr;
static isr_function_t dummy_pin_int4_irq_isr;
static isr_function_t dummy_pin_int5_irq_isr;
static isr_function_t dummy_pin_int6_irq_isr;
static isr_function_t dummy_pin_int7_irq_isr;
static isr_function_t dummy_spi2_irq_isr;
static isr_function_t dummy_spi3_irq_isr;
static isr_function_t dummy_reserved2_irq_isr;
static isr_function_t dummy_rit_irq_isr;
static isr_function_t dummy_reserved3_irq_isr;
static isr_function_t dummy_reserved4_irq_isr;
static isr_function_t dummy_reserved5_irq_isr;
static isr_function_t dummy_reserved6_irq_isr;

/**
 * Interrupt Vector Table
 */
isr_function_t *const g_interrupt_vector_table[] __attribute__ ((section(".vectortable"))) = {
    [INT_Initial_Stack_Pointer] = (void *)&g_cortex_m_exception_stack.es_stack_underflow_marker,

    /*
     * Processor exceptions
     */
    [INT_Initial_Program_Counter] = cortex_m_reset_handler,
    [INT_NMI] = cortex_m_nmi_isr,
    [INT_Hard_Fault] = cortex_m_hard_fault_exception_handler,
    [INT_MemoryManagement] = cortex_m_memory_management_exception_handler,
    [INT_BusFault] = cortex_m_bus_fault_exception_handler,
    [INT_UsageFault] = cortex_m_usage_fault_exception_handler,
    [INT_SVCall] = cortex_m_svc_exception_handler,
    [INT_DebugMonitor] = cortex_m_debug_monitor_exception_handler,
    [INT_PendableSrvReq] = cortex_m_pendsv_exception_handler,
    [INT_SysTick] = cortex_m_systick_isr,

    /* Interrupts external to the Cortex-M core*/
    [INT_WDT_IRQ] = dummy_wdt_irq_isr,
    [INT_BOD_IRQ] = dummy_bod_irq_isr,
    [INT_Reserved0_IRQ] = dummy_reserved0_irq_isr,
    [INT_DMA_IRQ] = dummy_dma_irq_isr,
    [INT_GINT0_IRQ] = dummy_gint0_irq_isr,
    [INT_PIN_INT0_IRQ] = dummy_pin_int0_irq_isr,
    [INT_PIN_INT1_IRQ] = dummy_pin_int1_irq_isr,
    [INT_PIN_INT2_IRQ] = dummy_pin_int2_irq_isr,
    [INT_PIN_INT3_IRQ] = dummy_pin_int3_irq_isr,
    [INT_UTICK_IRQ] = dummy_utick_irq_isr,
    [INT_MRT_IRQ] = dummy_mrt_irq_isr,
    [INT_CT32B0_IRQ] = dummy_ct32b0_irq_isr,
    [INT_CT32B1_IRQ] = dummy_ct32b1_irq_isr,
    [INT_CT32B2_IRQ] = dummy_ct32b2_irq_isr,
    [INT_CT32B3_IRQ] = dummy_ct32b3_irq_isr,
    [INT_CT32B4_IRQ] = dummy_ct32b4_irq_isr,
    [INT_SCT0_IRQ] = dummy_sct0_irq_isr,
    [INT_UART0_IRQ] = lpc54102_uart0_irq_isr,
    [INT_UART1_IRQ] = dummy_uart1_irq_isr,
    [INT_UART2_IRQ] = dummy_uart2_irq_isr,
    [INT_UART3_IRQ] = dummy_uart3_irq_isr,
    [INT_I2C0_IRQ] = dummy_i2c0_irq_isr,
    [INT_I2C1_IRQ] = dummy_i2c1_irq_isr,
    [INT_I2C2_IRQ] = dummy_i2c2_irq_isr,
    [INT_SPI0_IRQ] = dummy_spi0_irq_isr,
    [INT_SPI1_IRQ] = dummy_spi1_irq_isr,
    [INT_ADC_SEQA_IRQ] = dummy_adc_seqa_irq_isr,
    [INT_ADC_SEQB_IRQ] = dummy_adc_seqb_irq_isr,
    [INT_ADC_THCMP_IRQ] = dummy_adc_thcmp_irq_isr,
    [INT_RTC_IRQ] = dummy_rtc_irq_isr,
    [INT_Reserved1_IRQ] = dummy_reserved1_irq_isr,
    [INT_MAILBOX_IRQ] = dummy_mailbox_irq_isr,

    /* External Interrupts - For M4 only */
    [INT_GINT1_IRQ] = dummy_int_gint1_irq_isr,
    [INT_PIN_INT4_IRQ] = dummy_pin_int4_irq_isr,
    [INT_PIN_INT5_IRQ] = dummy_pin_int5_irq_isr,
    [INT_PIN_INT6_IRQ] = dummy_pin_int6_irq_isr,
    [INT_PIN_INT7_IRQ] = dummy_pin_int7_irq_isr,
    [INT_SPI2_IRQ] = dummy_spi2_irq_isr,
    [INT_SPI3_IRQ] = dummy_spi3_irq_isr,
    [INT_Reserved2_IRQ] = dummy_reserved2_irq_isr,
    [INT_RIT_IRQ] = dummy_rit_irq_isr,
    [INT_Reserved3_IRQ] = dummy_reserved3_irq_isr,
    [INT_Reserved4_IRQ] = dummy_reserved4_irq_isr,
    [INT_Reserved5_IRQ] = dummy_reserved5_irq_isr,
    [INT_Reserved6_IRQ] = dummy_reserved6_irq_isr,
};

C_ASSERT(
    ARRAY_SIZE(g_interrupt_vector_table) ==
    CORTEX_M_IRQ_VECTOR_BASE + SOC_NUM_INTERRUPT_CHANNELS);

/**
 * McRTOS interrupt object for the UART0 interrupt
 */
struct rtos_interrupt *g_rtos_interrupt_uart0_p = NULL;

/**
 * Global array of non-const structures for UART devices
 * (allocated in SRAM space)
 */
static struct uart_device_var g_uart_devices_var[] =
{
    [0] = {
        .urt_initialized = false,
        .urt_received_bytes_dropped = 0,
        .urt_transmit_bytes_dropped = 0,
        },
};


/**
 * Global array of const structures for UART devices for the K64F SoC
 * (allocated in flash space)
 */
static const struct uart_device g_uart_devices[] =
{
    [0] = {
        .urt_signature = UART_DEVICE_SIGNATURE,
	.urt_name = "UART0",
        .urt_var_p = &g_uart_devices_var[0],
        .urt_mmio_uart_p = LPC_USART0,
        .urt_tx_pin = PIN_INITIALIZER(PIN_PORT_0, 1, IOCON_FUNC1),
        .urt_rx_pin = PIN_INITIALIZER(PIN_PORT_0, 0, IOCON_FUNC1),
        .urt_async_apb_control_mask = APBCLKCTRL_UART0_MASK,
        .urt_rtos_interrupt_params = {
            .irp_name_p = "UART0 Interrupt",
            .irp_isr_function_p = lpc54102_uart0_irq_isr,
            .irp_arg_p =  (void *)&g_uart_devices[0],
            .irp_channel = VECTOR_NUMBER_TO_IRQ_NUMBER(INT_UART0_IRQ),
            .irp_priority = UART0_INTERRUPT_PRIORITY,
            .irp_cpu_id = 0,
        },

        .urt_rtos_interrupt_pp = &g_rtos_interrupt_uart0_p,

        .urt_transmit_queue_name_p = "UART0 transmit queue",
        .urt_receive_queue_name_p = "UART0 receive queue",
    },
};

C_ASSERT(
    ARRAY_SIZE(g_uart_devices) == ARRAY_SIZE(g_uart_devices_var));

const struct uart_device *const g_console_serial_port_p = &g_uart_devices[0];

/**
 * Matrix to keep track of what pins are currently in use. If a pin is not in
 * use (set_pin_function() has not been called for it), its entry is NULL.
 */
static const struct pin_info *g_pins_in_use_map[NUM_PIN_PORTS][NUM_PINS_PER_PORT];

static void
pll_init(void)
{
    uint32_t reg_value;

