jgrivera67/McRTOS/src/BoardSupport/LPC-54102/lpc54102_soc_hardware_abstractions.c
    /*
     * Select the PLL input to the IRC
     */
    write_32bit_mmio_register(&LPC_SYSCON->SYSPLLCLKSEL, 0x0);

    /*
     * Power down PLL to change the PLL divider ratio
     */
    write_32bit_mmio_register(&LPC_SYSCON->PDRUNCFGSET, SYSCON_PDRUNCFG_PD_SYS_PLL);

    /*
     * Get System PLL input clock rate:
     */
    reg_value = read_32bit_mmio_register(&LPC_SYSCON->SYSPLLCLKSEL);
    uint_fast8_t clk_sel = GET_BIT_FIELD(reg_value, SYSPLLCLKSEL_SEL_MASK, SYSPLLCLKSEL_SEL_SHIFT);
    FDC_ASSERT(clk_sel == 0x0, clk_sel, 0);

    /*
     * Set PLL output based on desired CPU clock rate:
     */

    /* Baseline parameters (no input or output dividers) */
    uint32_t pllPreDivider = 3;	/* SYSCON_IRC_FREQ / GCD(SYSCON_IRC_FREQ, CPU_CLOCK_FREQ_IN_HZ) */
    uint32_t pllPostDivider = 0;	/* 0 implies post-divider will be disabled */
    uint32_t multFccoDiv = 1;

    /* Determine PLL multipler */
    uint32_t nDivOutHz = SYSCON_IRC_FREQ / pllPreDivider;
    uint32_t pllMultiplier = (CPU_CLOCK_FREQ_IN_HZ / nDivOutHz) / multFccoDiv;

    /* Will bumping up M by 1 get us closer to the desired CCO frequency? */
    if ((nDivOutHz * ((multFccoDiv * pllMultiplier * 2) + 1)) < (CPU_CLOCK_FREQ_IN_HZ * 2)) {
            pllMultiplier++;
    }

    /*
     * Setup filtering:
     */
    uint32_t pllSelP;
    uint32_t pllSelI;
    uint32_t pllSelR;

    pllFindSel(pllMultiplier, true, &pllSelP, &pllSelI, &pllSelR);

    /*
     * Power off PLL during setup changes
     */
    write_32bit_mmio_register(&LPC_SYSCON->PDRUNCFGSET,
                              SYSCON_PDRUNCFG_PD_SYS_PLL);

    /*
     * Setup PLL:
     */

    /*
     * Set PLL control:
     */
    reg_value =
            (pllSelR << SYSCON_SYSPLLCTRL_SELR_P) |	    /* Filter coefficient */
            (pllSelI << SYSCON_SYSPLLCTRL_SELI_P) |	    /* Filter coefficient */
            (pllSelP << SYSCON_SYSPLLCTRL_SELP_P) |	    /* Filter coefficient */
            (1 << SYSCON_SYSPLLCTRL_BYPASS_FBDIV2_P) |      /* Extra M / 2 divider? */
            (1 << SYSCON_SYSPLLCTRL_BANDSEL_SSCGREG_N_P) |  /* Manual bandwidth selection enabled */
            (1 << SYSCON_SYSPLLCTRL_DIRECTO_P);	            /* Bypass post-divider */

    write_32bit_mmio_register(&LPC_SYSCON->SYSPLLCTRL, reg_value);

    /*
     * Set N (prediv):
     */
    reg_value = PLL_NDEC_VAL_SET(pllEncodeN(pllPreDivider));

    write_32bit_mmio_register(&LPC_SYSCON->SYSPLLNDEC, reg_value);
    write_32bit_mmio_register(&LPC_SYSCON->SYSPLLNDEC,
                              reg_value | PLL_NDEC_NREQ /*latch*/
                             );

    /*
     * Set P (postdiv):
     */
    reg_value = PLL_PDEC_VAL_SET(pllEncodeP(pllPostDivider));
    write_32bit_mmio_register(&LPC_SYSCON->SYSPLLPDEC,
                              reg_value);
    write_32bit_mmio_register(&LPC_SYSCON->SYSPLLPDEC,
                              reg_value | PLL_PDEC_PREQ /*latch*/
                             );

    /*
     * Set (mult) and use manual filter, disable SS mode:
     */
    reg_value = PLL_SSCG0_MDEC_VAL_SET(pllEncodeM(pllMultiplier)) |
                (1 << PLL_SSCG0_SEL_EXT_SSCG_N_P);
    write_32bit_mmio_register(&LPC_SYSCON->SYSPLLSSCTRL[0],
                              reg_value);
    write_32bit_mmio_register(&LPC_SYSCON->SYSPLLSSCTRL[0],
                              reg_value | PLL_SSCG0_MREQ /*latch*/
                             );

    /*
     * Power down SSC, not used
     */
    write_32bit_mmio_register(&LPC_SYSCON->SYSPLLSSCTRL[1],
                              PLL_SSCG1_MOD_PD_SSCGCLK_N);
    write_32bit_mmio_register(&LPC_SYSCON->SYSPLLSSCTRL[1],
                              PLL_SSCG1_MOD_PD_SSCGCLK_N | PLL_SSCG1_MD_REQ /*latch*/
                             );

    /*
     * Not using spread spectrum mode:
     */
    uint32_t current_ssctrl_reg =
        read_32bit_mmio_register(&LPC_SYSCON->SYSPLLSSCTRL[0]);

    FDC_ASSERT(current_ssctrl_reg & SYSPLLSSCTRL_SEL_EXT_MASK,
               current_ssctrl_reg, 0);

    /*
     * Power on PLL:
     */
    write_32bit_mmio_register(&LPC_SYSCON->PDRUNCFGCLR,
                              SYSCON_PDRUNCFG_PD_SYS_PLL);

    /*
     * this sequence acclerates the PLL lock time
     */
    reg_value = SYSPLLSSCTRL_SEL_EXT_MASK;
    SET_BIT_FIELD(reg_value, SYSPLLSSCTRL_MDEC_MASK,
                  SYSPLLSSCTRL_MDEC_SHIFT, 0x3fff);

    /* Set mreq to activate */
    write_32bit_mmio_register(&LPC_SYSCON->SYSPLLSSCTRL[0],
                              reg_value | SYSPLLSSCTRL_MREQ_MASK);

    /* clear mreq to prepare for restoring mreq */
    write_32bit_mmio_register(&LPC_SYSCON->SYSPLLSSCTRL[0],
                              reg_value);

    /* Delay for 20 uSec @ 12Mhz*/
    delay_loop(48);

    /* set original value back with mreq */
    write_32bit_mmio_register(&LPC_SYSCON->SYSPLLSSCTRL[0],
                              current_ssctrl_reg | SYSPLLSSCTRL_MREQ_MASK);

    /*  Turn on PLL again??? */
    write_32bit_mmio_register(&LPC_SYSCON->PDRUNCFGCLR,
                              SYSCON_PDRUNCFG_PD_SYS_PLL);

    /*
     * Wait until PLL is locked:
     */
    do {
        reg_value = read_32bit_mmio_register(&LPC_SYSCON->SYSPLLSTAT);
    } while ((reg_value & SYSPLLSTAT_LOCK_MASK) == 0);
}


static void
system_clocks_init(void)
{

    uint32_t reg_value;

    /*
     * Enable clocks for IOCON, INPUTMUX and all GPIO port clocks:
     */
    reg_value = SYSCON0_IOCON_MASK |
                SYSCON0_INPUTMUX_MASK |
                SYSCON0_GPIO0_MASK |
                SYSCON0_GPIO1_MASK;
# if 0 //???
                SYSCON0_PINT_MASK |
                SYSCON0_GINT_MASK;
#endif

    write_32bit_mmio_register(&LPC_SYSCON->AHBCLKCTRLSET[0], reg_value);

    /*
     * Clear reset for the GPIO ports:
     */
    write_32bit_mmio_register(&LPC_SYSCON->PRESETCTRLCLR[0],
                              SYSCON0_GPIO0_MASK | SYSCON0_GPIO1_MASK);
    /*
     * Turn on the IRC by clearing the power down bit:
     */
    write_32bit_mmio_register(&LPC_SYSCON->PDRUNCFGCLR,
                              SYSCON_PDRUNCFG_PD_IRC_OSC | SYSCON_PDRUNCFG_PD_IRC);

    pll_init();

