jgrivera67/McRTOS/src/BoardSupport/LPC-54102/lpc54102_soc_hardware_abstractions.c
    /*
     * Set system clock divider to 1:
     */
    write_32bit_mmio_register(&LPC_SYSCON->AHBCLKDIV, 0x1);

    /*
     * Set main clock source to the system PLL output. This will drive 24MHz
     * for the main clock and 24MHz for the system clock
     */
    reg_value = 0;
    SET_BIT_FIELD(reg_value, MAINCLKSELB_SEL_MASK, MAINCLKSELB_SEL_SHIFT,
                  0x2);
    write_32bit_mmio_register(&LPC_SYSCON->MAINCLKSELB, reg_value);

    /*
     * ASYSNC SYSCON needs to be on or all serial peripheral won't work.
     */
    write_32bit_mmio_register(&LPC_SYSCON->ASYNCAPBCTRL,
                              ASYNCAPBCTR_ENABLE_MASK);

    /*
     * Set asynchronous APB clock divider (for peripherals attached to the async
     * APB bridge):
     */
    write_32bit_mmio_register(&LPC_ASYNC_SYSCON->ASYNCCLKDIV, 0x1);

#if 0
    /*
     * Enable clock for fractional divider for UARTs:
     */
    write_32bit_mmio_register(&LPC_ASYNC_SYSCON->ASYNCAPBCLKCTRLSET,
                              APBCLKCTRL_FRACDIV_MASK);
#endif

    /*
     * Set asynchronous APB clock source to IRC input:
     */
    write_32bit_mmio_register(&LPC_ASYNC_SYSCON->ASYNCAPBCLKSELA, 0x0);
    write_32bit_mmio_register(&LPC_ASYNC_SYSCON->ASYNCAPBCLKSELB, 0x3);

    /*
     * Set CLKOUT clock source and divider to 1:
     */
    write_32bit_mmio_register(&LPC_SYSCON->CLKOUTSELA, 0x0);
    write_32bit_mmio_register(&LPC_SYSCON->CLKOUTSELB, 0x0);
    write_32bit_mmio_register(&LPC_SYSCON->CLKOUTDIV, 0x1);

    /*
     * Enable clocks for system FIFO peripheral and clear its reset:
     * (used for UART and SPI interfaces)
     */
    write_32bit_mmio_register(&LPC_SYSCON->AHBCLKCTRLSET[1],
                              SYSCON1_FIFO_MASK);
    write_32bit_mmio_register(&LPC_SYSCON->PRESETCTRLCLR[1],
                              SYSCON1_FIFO_MASK);
}


/**
 *  SoC-specific early initialization to be invoked at the beginning of
 *  the Reset exception handler.
 */
void
soc_early_init(void)
{
    /*
     * Enable clock for SRAM2, which is disabled upon reset
     */
    write_32bit_mmio_register(&LPC_SYSCON->AHBCLKCTRLSET[0],
                              SYSCON0_SRAM2_MASK);
}


/**
 *  Initializes board hardware.
 *
 *  @pre This function must be called with interrupts disabled.
 */
cpu_reset_cause_t
soc_hardware_init(void)
{
#   ifdef _RELIABILITY_CHECKS_
    cpu_status_register_t reg_primask = __get_PRIMASK();

    FDC_ASSERT(
        CPU_INTERRUPTS_ARE_DISABLED(reg_primask),
        reg_primask, 0);
#   endif

    cpu_reset_cause_t reset_cause = find_reset_cause();

    capture_fdc_msg_printf("Last reset cause: %#x\n", reset_cause);

    system_clocks_init();

#   ifdef _CPU_CYCLES_MEASURE_
    init_cpu_clock_cycles_counter();
#   endif

    cortex_m_nvic_init();

    uart_init(
        g_console_serial_port_p,
        CONSOLE_SERIAL_PORT_BAUD_RATE,
        CONSOLE_SERIAL_PORT_MODE);

    //???    uart_putchar_with_polling(g_console_serial_port_p, '8'); //???

    capture_fdc_msg_printf("%s initialized (Tx FIFO size: %u, Rx FIFO size: %u)\n",
		 g_console_serial_port_p->urt_name,
		 g_console_serial_port_p->urt_var_p->urt_tx_fifo_size,
		 g_console_serial_port_p->urt_var_p->urt_rx_fifo_size);

    cortex_m_mpu_init();
    return reset_cause;
}


void
soc_reset(void)
{
    __disable_irq();

    /*
     * Stop all peripherals:
     */
    uart_stop(g_console_serial_port_p);

    /*
     * Trigger software reset in the SoC:
     */
    NVIC_SystemReset();
}


static cpu_reset_cause_t
find_reset_cause(void)
{
    cpu_reset_cause_t generic_cause;
    uint32_t reg_value = read_32bit_mmio_register(&LPC_SYSCON->SYSRSTSTAT);

    if (reg_value & SYSCON_RST_POR) {
        generic_cause = GRC_POWER_ON_RESET;
    } else if (reg_value & SYSCON_RST_EXTRST) {
        generic_cause = GRC_EXTERNAL_PIN_RESET;
    } else if (reg_value & SYSCON_RST_WDT) {
        generic_cause = GRC_WATCHDOG_RESET;
    } else if (reg_value & SYSCON_RST_SYSRST) {
        generic_cause = GRC_SOFTWARE_RESET;
    } else if (reg_value != 0) {
        generic_cause = GRC_OTHER_HW_REASON_RESET;
    }

    return generic_cause;
}


bool
software_reset_happened(void)
{
    bool caller_was_privileged = rtos_enter_privileged_mode();

    uint32_t reg_value = read_32bit_mmio_register(&LPC_SYSCON->SYSRSTSTAT);

    if (!caller_was_privileged) {
        rtos_exit_privileged_mode();
    }

    return (reg_value & SYSCON_RST_SYSRST) != 0;
}


#ifdef _CPU_CYCLES_MEASURE_
static void
init_cpu_clock_cycles_counter(void)
{
    uint32_t reg_value;

    /*
     * Enable DWT and ITM blocks of the Cortex-M4 core:
     */
    reg_value = read_32bit_mmio_register(&CoreDebug->DEMCR);
    reg_value |= CoreDebug_DEMCR_TRCENA_Msk;
    write_32bit_mmio_register(&CoreDebug->DEMCR, reg_value);

    /*
     * Reset CPU clock cycle counter:
     */
    write_32bit_mmio_register(&DWT->CYCCNT, 0);

    /*
     * Enable DWT's CYCCNT:
     */

    reg_value = read_32bit_mmio_register(&DWT->CTRL);

    /*
     * Check that this cortex-M4 core does implement CYCCNT:
     */
    FDC_ASSERT((reg_value & DWT_CTRL_NOCYCCNT_Msk) == 0,
	       reg_value, 0);

    reg_value |= DWT_CTRL_CYCCNTENA_Msk;
    write_32bit_mmio_register(&DWT->CTRL, reg_value);
}


uint32_t
get_cpu_clock_cycles(void)
{
#if 0
    uint32_t low_reg_value = read_32bit_mmio_register(&PIT_LTMR64L);

    /*
     * TODO: PIT module frequency is half of the CPU frequency, so may
     * need to multiply by 2 to get the accurate number CPU clock cycles.
     */
    return low_reg_value * 2;
#else
    return DWT->CYCCNT;
#endif
}
#endif /* _CPU_CYCLES_MEASURE_ */

void set_pin_function(const struct pin_info *pin_p, uint32_t pin_flags)
{
    const struct pin_info **pins_in_use_entry_p =
	&g_pins_in_use_map[pin_p->pin_port][pin_p->pin_index];

    FDC_ASSERT_CPU_INTERRUPTS_DISABLED();
    if (*pins_in_use_entry_p != NULL) {
	fdc_error_t fdc_error =
            CAPTURE_FDC_ERROR("Pin already allocated", pin_p->pin_port,
			      pin_p->pin_index);

        fatal_error_handler(fdc_error);
    }

