jgrivera67/McRTOS/src/BoardSupport/LPC-54102/lpc54102_soc_hardware_abstractions.c
    write_32bit_mmio_register(
        &LPC_IOCON->PIO[pin_p->pin_port][pin_p->pin_index],
        pin_p->pin_function | pin_flags);

    *pins_in_use_entry_p = pin_p;
}


/**
 * It configures a GPIO pin of the K64F SoC
 */
void
configure_gpio_pin(const struct gpio_pin *gpio_pin_p, uint32_t pin_flags,
		   bool is_output)
{
    uint32_t reg_value;

    bool caller_was_privileged = rtos_enter_privileged_mode();

    cpu_status_register_t cpu_status_register = rtos_k_disable_cpu_interrupts();

    set_pin_function(&gpio_pin_p->pin_info, pin_flags);

    __IO uint32_t *dir_reg_p = &LPC_GPIO->DIR[gpio_pin_p->pin_info.pin_port];

   if (is_output) {

        reg_value = read_32bit_mmio_register(dir_reg_p);
        reg_value |= gpio_pin_p->pin_bit_mask;
        write_32bit_mmio_register(dir_reg_p, reg_value);
    } else {
        reg_value = read_32bit_mmio_register(dir_reg_p);
        reg_value &= ~gpio_pin_p->pin_bit_mask;
        write_32bit_mmio_register(dir_reg_p, reg_value);
    }

    rtos_k_restore_cpu_interrupts(cpu_status_register);

    if (!caller_was_privileged) {
        rtos_exit_privileged_mode();
    }
}


void
activate_output_pin(const struct gpio_pin *gpio_pin_p)
{
    bool caller_was_privileged = rtos_enter_privileged_mode();

#   ifdef DEBUG
    uint32_t reg_value =
        read_32bit_mmio_register(&LPC_GPIO->DIR[gpio_pin_p->pin_info.pin_port]);

    FDC_ASSERT(
        reg_value & gpio_pin_p->pin_bit_mask,
        gpio_pin_p, reg_value);
#   endif

    if (gpio_pin_p->pin_is_active_high) {
        write_32bit_mmio_register(&LPC_GPIO->SET[gpio_pin_p->pin_info.pin_port],
                                  gpio_pin_p->pin_bit_mask);
    } else {
        write_32bit_mmio_register(&LPC_GPIO->CLR[gpio_pin_p->pin_info.pin_port],
                                  gpio_pin_p->pin_bit_mask);
    }

    if (!caller_was_privileged) {
        rtos_exit_privileged_mode();
    }
}


void
deactivate_output_pin(const struct gpio_pin *gpio_pin_p)
{
    bool caller_was_privileged = rtos_enter_privileged_mode();

#   ifdef DEBUG
    uint32_t reg_value =
        read_32bit_mmio_register(&LPC_GPIO->DIR[gpio_pin_p->pin_info.pin_port]);

    FDC_ASSERT(
        reg_value & gpio_pin_p->pin_bit_mask,
        reg_value, gpio_pin_p->pin_bit_mask);
#   endif

    if (gpio_pin_p->pin_is_active_high) {
        write_32bit_mmio_register(&LPC_GPIO->CLR[gpio_pin_p->pin_info.pin_port],
                                  gpio_pin_p->pin_bit_mask);
    } else {
        write_32bit_mmio_register(&LPC_GPIO->SET[gpio_pin_p->pin_info.pin_port],
                                  gpio_pin_p->pin_bit_mask);
    }

    if (!caller_was_privileged) {
        rtos_exit_privileged_mode();
    }
}


void
toggle_output_pin(const struct gpio_pin *gpio_pin_p)
{
    bool caller_was_privileged = rtos_enter_privileged_mode();

#   ifdef DEBUG
    uint32_t reg_value =
        read_32bit_mmio_register(&LPC_GPIO->DIR[gpio_pin_p->pin_info.pin_port]);

    FDC_ASSERT(
        reg_value & gpio_pin_p->pin_bit_mask,
        gpio_pin_p, reg_value);
#   endif

    write_32bit_mmio_register(&LPC_GPIO->NOT[gpio_pin_p->pin_info.pin_port],
                              gpio_pin_p->pin_bit_mask);

    if (!caller_was_privileged) {
        rtos_exit_privileged_mode();
    }
}


bool
read_input_pin(const struct gpio_pin *gpio_pin_p)
{
    bool caller_was_privileged = rtos_enter_privileged_mode();

    uint32_t reg_value =
        read_32bit_mmio_register(&LPC_GPIO->PIN[gpio_pin_p->pin_info.pin_port]);

    bool result = ((reg_value & gpio_pin_p->pin_bit_mask) != 0);

#   ifdef DEBUG
     reg_value = read_8bit_mmio_register(&LPC_GPIO->B[gpio_pin_p->pin_info.pin_port]
                                                     [gpio_pin_p->pin_info.pin_index]);
    DBG_ASSERT(reg_value == result, reg_value, result);
#   endif

    if (!caller_was_privileged) {
        rtos_exit_privileged_mode();
    }

    return result;
}


void
uart_init(
    const struct uart_device *uart_device_p,
    uint32_t baud_rate,
    uint8_t mode)
{
    uint32_t reg_value;
    uint_fast8_t uart_index = uart_device_p - g_uart_devices;

    FDC_ASSERT(
        uart_device_p->urt_signature == UART_DEVICE_SIGNATURE,
        uart_device_p->urt_signature, uart_device_p);

    struct uart_device_var *uart_var_p = uart_device_p->urt_var_p;
    UART_REGS_T *uart_mmio_registers_p = uart_device_p->urt_mmio_uart_p;

    FDC_ASSERT(!uart_var_p->urt_initialized, uart_device_p, 0);
    FDC_ASSERT(mode == 0, mode, uart_device_p);
    FDC_ASSERT_CPU_INTERRUPTS_DISABLED();

    /*
     * Enable clock for the UART:
     */
    write_32bit_mmio_register(&LPC_ASYNC_SYSCON->ASYNCAPBCLKCTRLSET,
                              uart_device_p->urt_async_apb_control_mask);

    /*
     * Clear reset for the UART:
     */
    write_32bit_mmio_register(&LPC_ASYNC_SYSCON->ASYNCPRESETCTRLCLR,
                              uart_device_p->urt_async_apb_control_mask);

    /*
     * Configure the uart for 8-bit mode, no parity, 1 stop bit (mode is 0):
     */
    reg_value = read_32bit_mmio_register(&uart_mmio_registers_p->CFG);
    SET_BIT_FIELD(reg_value, UART_CFG_DATALEN_MASK, UART_CFG_DATALEN_SHIFT, 0x1);
    SET_BIT_FIELD(reg_value, UART_CFG_PARITYSEL_MASK, UART_CFG_PARITYSEL_SHIFT, 0x0);
    reg_value &= ~UART_CFG_STOPLEN_MASK;
    write_32bit_mmio_register(&uart_mmio_registers_p->CFG, reg_value);

    /*
     * Get Tx and Rx FIFO space total sizes
     */
    reg_value = read_32bit_mmio_register(&LPC_FIFO->common.FIFOCTLUSART);
    uint_fast8_t total_tx_fifo_space_size = GET_BIT_FIELD(
                                                reg_value,
					        FIFOCTLUSART_TXFIFOTOTAL_MASK,
					        FIFOCTLUSART_TXFIFOTOTAL_SHIFT);

    FDC_ASSERT(total_tx_fifo_space_size != 0 &&
               total_tx_fifo_space_size % LPC_FIFO_USART_MAX == 0,
               total_tx_fifo_space_size, LPC_FIFO_USART_MAX);

    uint_fast8_t total_rx_fifo_space_size = GET_BIT_FIELD(
                                                reg_value,
					        FIFOCTLUSART_RXFIFOTOTAL_MASK,
					        FIFOCTLUSART_RXFIFOTOTAL_SHIFT);

    FDC_ASSERT(total_rx_fifo_space_size != 0 &&
               total_rx_fifo_space_size % LPC_FIFO_USART_MAX == 0,
               total_rx_fifo_space_size, LPC_FIFO_USART_MAX);

