jgrivera67/McRTOS/src/BoardSupport/LPC-54102/lpc54102_soc_hardware_abstractions.c
    /*
     * Configure Tx and RX FIFOs:
     * - Pause all UARTs Rx FIFO operations and Tx FIFO operations
     * - Allocate Rx and Tx FIFO space for this UART
     * - Tx FIFO threshold = total num entries (generate interrupt when Tx FIFO is empty)
     * - Rx FIFO threshold = 0 (generate interrupt when Rx FIFO is not empty)
     * - Flush Tx and Rx FIFOs
     * - Resume all UARTs Rx FIFO operations and Tx FIFO operations
     */
    write_32bit_mmio_register(
        &LPC_FIFO->common.FIFOCTLUSART,
        FIFOCTLUSART_RXPAUSE_MASK | FIFOCTLUSART_TXPAUSE_MASK);

    uart_var_p->urt_tx_fifo_size = total_tx_fifo_space_size / LPC_FIFO_USART_MAX;
    uart_var_p->urt_rx_fifo_size = total_rx_fifo_space_size / LPC_FIFO_USART_MAX;

    reg_value = 0;
    SET_BIT_FIELD(reg_value, FIFOCFGUSART_TXSIZE_MASK, FIFOCFGUSART_TXSIZE_SHIFT,
                  uart_var_p->urt_tx_fifo_size);
    SET_BIT_FIELD(reg_value, FIFOCFGUSART_RXSIZE_MASK, FIFOCFGUSART_RXSIZE_SHIFT,
                  uart_var_p->urt_rx_fifo_size);
    write_32bit_mmio_register(
        &LPC_FIFO->common.FIFOCFGUSART[uart_index], reg_value);

    write_32bit_mmio_register(
        &LPC_FIFO->common.FIFOUPDATEUSART,
        FIFOUPDATEUSART_RXSIZE_MASK(uart_index) |
        FIFOUPDATEUSART_TXSIZE_MASK(uart_index));

    reg_value = 0;
    SET_BIT_FIELD(reg_value, FIFO_UART_CFGUSART_TX_THRESHOLD_MASK,
                  FIFO_UART_CFGUSART_TX_THRESHOLD_SHIFT,
                  uart_var_p->urt_tx_fifo_size);
    SET_BIT_FIELD(reg_value, FIFO_UART_CFGUSART_RX_THRESHOLD_MASK,
                  FIFO_UART_CFGUSART_RX_THRESHOLD_SHIFT,
                  0);
    write_32bit_mmio_register(
        &LPC_FIFO->usart[uart_index].CFG, reg_value);

#if 0
    write_32bit_mmio_register(
        &LPC_FIFO->usart[uart_index].CTLSET,
        FIFO_UART_CTL_RXFLUSH_MASK |
        FIFO_UART_CTL_TXFLUSH_MASK);
#endif

     /* Resume all UART FIFOs: */
    write_32bit_mmio_register(&LPC_FIFO->common.FIFOCTLUSART, 0x0);

    uart_var_p->urt_fifos_enabled = true;

    /*
     * Configure Tx and Rx pins:
     */
    set_pin_function(&uart_device_p->urt_tx_pin, IOCON_DIGITAL_EN);
    set_pin_function(&uart_device_p->urt_rx_pin, IOCON_DIGITAL_EN);

   /*
    * Calculate baud rate settings (assuming OSRVAL = 16):
    */
    reg_value = SYSCON_IRC_FREQ / (baud_rate * 16);

    FDC_ASSERT(reg_value >= 1 && reg_value <= UINT16_MAX + 1,
               uart_device_p, reg_value);

#if 1 //???
    /*
     * Set Baud rat generator (BRG) register (BRG):
     */
    write_32bit_mmio_register(&uart_mmio_registers_p->BRG, reg_value - 1);
#else
    reg_value = read_32bit_mmio_register(&uart_mmio_registers_p->CTL);
    reg_value |= UART_CTL_AUTOBAUD_MASK;
    write_32bit_mmio_register(&uart_mmio_registers_p->CTL, reg_value);
#endif

    /*
     * Enable UART:
     */
    reg_value = read_32bit_mmio_register(&uart_mmio_registers_p->CFG);
    reg_value |= UART_CFG_ENABLE_MASK;
    write_32bit_mmio_register(&uart_mmio_registers_p->CFG, reg_value);

    /*
     * Initialize transmit queue:
     */
    rtos_k_byte_circular_buffer_init(
        uart_device_p->urt_transmit_queue_name_p,
        UART_TRANSMIT_QUEUE_SIZE_IN_BYTES,
        uart_var_p->urt_transmit_queue_storage,
        NULL,
        &uart_var_p->urt_transmit_queue);

    /*
     * Initialize receive queue:
     */
    rtos_k_byte_circular_buffer_init(
        uart_device_p->urt_receive_queue_name_p,
        UART_RECEIVE_QUEUE_SIZE_IN_BYTES,
        uart_var_p->urt_receive_queue_storage,
        NULL,
        &uart_var_p->urt_receive_queue);

    /*
     * Register McRTOS interrupt handler for UART Rx/Tx interrupt:
     */
    rtos_k_register_interrupt(
        &uart_device_p->urt_rtos_interrupt_params,
        uart_device_p->urt_rtos_interrupt_pp);

    DBG_ASSERT(
        *uart_device_p->urt_rtos_interrupt_pp != NULL,
        uart_device_p->urt_rtos_interrupt_pp, uart_device_p);

    /*
     * NOTE: Generation of Tx/Rx FIFO interrupts is enabled in
     * uart_putchar() and uart_getchar() respectively
     */
    uart_var_p->urt_initialized = true;
}


static void
uart_stop(
    const struct uart_device *uart_device_p)
{
    uint32_t reg_value;
    struct uart_device_var *uart_var_p = uart_device_p->urt_var_p;
    UART_REGS_T *uart_mmio_registers_p = uart_device_p->urt_mmio_uart_p;

    /*
     * Disable UART:
     */
    reg_value = read_32bit_mmio_register(&uart_mmio_registers_p->CFG);
    reg_value &= ~UART_CFG_ENABLE_MASK;
    write_32bit_mmio_register(&uart_mmio_registers_p->CFG, reg_value);

    /*
     * Disable clock for the UART:
     */
    write_32bit_mmio_register(&LPC_ASYNC_SYSCON->ASYNCAPBCLKCTRLCLR,
                              uart_device_p->urt_async_apb_control_mask);

    uart_var_p->urt_initialized = false;
}


/**
 * Handling of "Tx FIFO empty" interrupt
 */
static void
lpc54102_fifo_uart_tx_interrupt_handling(uint_fast8_t uart_index,
				         struct uart_device_var *restrict uart_var_p)
{
    /*
     * NOTE: This interrupt source will be cleared when
     * the next character is transmitted
     */
    bool sw_transmit_queue_empty = false;

    /*
     * Disable interrupts, to prevent higher priority interrupts to write
     * data to the UART (i.e., printf's)
     */
    cpu_status_register_t cpu_status_register = rtos_k_disable_cpu_interrupts();

    /*
     * Fill the Tx FIFO as much as possible:
     */
    for (uint_fast8_t i = 0; i < uart_var_p->urt_tx_fifo_size; ++i) {
	uint8_t byte_to_transmit;
	bool entry_read = rtos_k_byte_circular_buffer_read(
			    &uart_var_p->urt_transmit_queue,
			    &byte_to_transmit,
			    false, 0);

	if (!entry_read) {
	    sw_transmit_queue_empty = true;
	    break;
	}

	write_32bit_mmio_register(&LPC_FIFO->usart[uart_index].TXDAT,
				 byte_to_transmit);
    }

    rtos_k_restore_cpu_interrupts(cpu_status_register);

    if (sw_transmit_queue_empty) {
	/*
	 * Disable "transmit FIFO empty" interrupt:
	 */
        write_32bit_mmio_register(
            &LPC_FIFO->usart[uart_index].CTLCLR,
            FIFO_UART_CTL_TXTHINTEN_MASK);
    }
}


/**
 * Handling of "Rx FIFO not empty" interrupt
 */
static void
lpc54102_fifo_uart_rx_interrupt_handling(uint_fast8_t uart_index,
                                         uint_fast8_t rx_fifo_length,
				         struct uart_device_var *restrict uart_var_p)
{
    uint_fast8_t i;
    uint_fast8_t byte_received;
    bool entry_written;
    uint32_t reg_value;

