jgrivera67/McRTOS/src/BoardSupport/LPC-54102/lpc54102_soc_hardware_abstractions.c
    DBG_ASSERT(
        rx_fifo_length > 0 && rx_fifo_length <= uart_var_p->urt_rx_fifo_size,
        rx_fifo_length, uart_var_p->urt_rx_fifo_size);

    /*
     * Drain the Rx FIFO:
     */
    for (i = 0; i < rx_fifo_length; i++) {
        reg_value =
            read_32bit_mmio_register(&LPC_FIFO->usart[uart_index].RXDATSTAT);

        if (reg_value & (FIFO_UART_RXDATSTAT_FRAMERR_MASK |
                         FIFO_UART_RXDATSTAT_PARITYERR_MASK |
                         FIFO_UART_RXDATSTAT_RXNOISE_MASK)) {
            CAPTURE_FDC_ERROR("UART receive error", reg_value, uart_index);
            continue;
        }

        byte_received = GET_BIT_FIELD(reg_value, FIFO_UART_RXDATSTAT_RXDAT_MASK,
                                      FIFO_UART_RXDATSTAT_RXDAT_SHIFT);

        entry_written = rtos_k_byte_circular_buffer_write(
                            &uart_var_p->urt_receive_queue,
                            byte_received,
                            false);

        if (!entry_written) {
            uart_var_p->urt_received_bytes_dropped ++;
            break;
        }
    }
}


/**
 * UART interrupt handler with interrupts enabled
 */
void
lpc54102_uart_interrupt_e_handler(
    struct rtos_interrupt *rtos_interrupt_p)
{
    uint32_t reg_value;

    FDC_ASSERT_RTOS_INTERRUPT_E_HANDLER_PRECONDITIONS(rtos_interrupt_p);

    const struct uart_device *uart_device_p =
        (struct uart_device *)rtos_interrupt_p->int_arg_p;

    DBG_ASSERT(
        uart_device_p->urt_signature == UART_DEVICE_SIGNATURE,
        uart_device_p->urt_signature, uart_device_p);

    struct uart_device_var *const restrict uart_var_p = uart_device_p->urt_var_p;
    uint_fast8_t uart_index = uart_device_p - g_uart_devices;

    DBG_ASSERT(uart_index < LPC_FIFO_USART_MAX, uart_index, LPC_FIFO_USART_MAX);

    DBG_ASSERT(
        uart_var_p->urt_initialized, uart_device_p, 0);

    reg_value = read_32bit_mmio_register(&LPC_FIFO->usart[uart_index].INTSTAT);

    /*
     * There is at least one Rx or Tx FIFO interrupt pending
     */
    FDC_ASSERT(
        (reg_value & (FIFO_UART_STAT_RXTH_MASK | FIFO_UART_STAT_TXTH_MASK)) != 0,
        reg_value, uart_device_p);

    /*
     * "Tx FIFO empty" interrupt:
     */
    if (reg_value & FIFO_UART_STAT_TXTH_MASK) {
#       ifdef DEBUG
        /*
         * NOTE: These asserts holds even if a higher prior interrupt handler
         * preempt us and calls uart_putchar(), since physical writes to the
         * UART FIFO only happen in this interrupt handler.
         */
        DBG_ASSERT(reg_value & FIFO_UART_STAT_TXEMPTY_MASK,
                   reg_value, uart_index);

        uint_fast8_t tx_fifo_free_count =
            GET_BIT_FIELD(reg_value,
                          FIFO_UART_STAT_TXCOUNT_MASK,
                          FIFO_UART_STAT_TXCOUNT_SHIFT);

        DBG_ASSERT(tx_fifo_free_count == uart_var_p->urt_tx_fifo_size,
                   tx_fifo_free_count, uart_var_p->urt_tx_fifo_size);
#       endif

	lpc54102_fifo_uart_tx_interrupt_handling(uart_index, uart_var_p);
    }

    /*
     * "Rx FIFO not empty" interrupt:
     */
    if (reg_value & FIFO_UART_STAT_RXTH_MASK) {
        DBG_ASSERT((reg_value & FIFO_UART_STAT_RXEMPTY_MASK) == 0,
                   reg_value, uart_index);

        uint_fast8_t rx_fifo_length =
            GET_BIT_FIELD(reg_value,
                          FIFO_UART_STAT_RXCOUNT_MASK,
                          FIFO_UART_STAT_RXCOUNT_SHIFT);

        DBG_ASSERT(rx_fifo_length != 0, uart_device_p, uart_index);

	lpc54102_fifo_uart_rx_interrupt_handling(uart_index, rx_fifo_length,
                                                 uart_var_p);
    }
}


#pragma GCC diagnostic push

#ifndef _RELIABILITY_CHECKS_
#pragma GCC diagnostic ignored "-Wunused-variable"
#endif

/**
 * Send a character over a UART serial port, blocking the caller on a condvar
 * if the UART Tx fifo is full.
 */
void
uart_putchar(
    _IN_ const struct uart_device *uart_device_p,
    _IN_ uint8_t c)
{
    struct uart_device_var *const uart_var_p = uart_device_p->urt_var_p;
    uint_fast8_t uart_index = uart_device_p - g_uart_devices;

    DBG_ASSERT(uart_var_p->urt_initialized, uart_var_p, uart_device_p);

    DBG_ASSERT_PRIVILEGED_CPU_MODE_AND_INTERRUPTS_ENABLED();

    if (rtos_k_caller_is_thread()) {
        bool entry_written =
            rtos_k_byte_circular_buffer_write(
                &uart_var_p->urt_transmit_queue, c, true);

        FDC_ASSERT(entry_written, uart_device_p, 0);
    } else {
        bool entry_written =
            rtos_k_byte_circular_buffer_write(
                &uart_var_p->urt_transmit_queue, c, false);

        if (!entry_written) {
            ATOMIC_POST_INCREMENT_UINT32(&uart_var_p->urt_transmit_bytes_dropped);
            return;
        }
    }

    /*
     * Enable generation of "transmit FIFO empty" interrupts if
     * necessary:
     *
     * NOTE: if the "transmit FIFO" is empty there will be a
     * pending "transmit FIFO empty" interrupt, regardless
     * of this interrupt being enabled or not in the UART. Thus, as soon
     * as we enable the generation of this interrupt, the interrupt will
     * fire, if the "transmit FIFO" was empty.
     */
    uint32_t reg_value =
        read_32bit_mmio_register(&LPC_FIFO->usart[uart_index].CTLSET);

    if ((reg_value & FIFO_UART_CTL_TXTHINTEN_MASK) == 0) {
        reg_value |= FIFO_UART_CTL_TXTHINTEN_MASK;
        write_32bit_mmio_register(&LPC_FIFO->usart[uart_index].CTLSET, reg_value);
    }
}

#pragma GCC diagnostic pop

/**
 * Send a character over a UART serial port, doing polling until the
 * character gets transmitted.
 */
void
uart_putchar_with_polling(
    _IN_ const struct uart_device *uart_device_p,
    _IN_ uint8_t c)
{
    struct uart_device_var *const uart_var_p = uart_device_p->urt_var_p;
    uint_fast8_t uart_index = uart_device_p - g_uart_devices;
    uint32_t reg_value;

    if (!uart_var_p->urt_initialized) {
        return;
    }

    /*
     * Disable "transmit FIFO empty" interrupt:
     */
    write_32bit_mmio_register(
        &LPC_FIFO->usart[uart_index].CTLCLR,
        FIFO_UART_CTL_TXTHINTEN_MASK);

