jgrivera67/McRTOS/src/BoardSupport/LPC-54102/lpc54102_soc_hardware_abstractions.c
    /*
     * Do polling until the UART's transmit FIFO is empty:
     */
    for ( ; ; ) {
        reg_value = read_32bit_mmio_register(&LPC_FIFO->usart[uart_index].STAT);
        if (reg_value & FIFO_UART_STAT_TXEMPTY_MASK) {
            break;
        }
    }

#   ifdef DEBUG
    uint_fast8_t tx_fifo_free_count =
        GET_BIT_FIELD(reg_value,
                      FIFO_UART_STAT_TXCOUNT_MASK,
                      FIFO_UART_STAT_TXCOUNT_SHIFT);

        DBG_ASSERT(tx_fifo_free_count == uart_var_p->urt_tx_fifo_size,
                   tx_fifo_free_count, uart_var_p->urt_tx_fifo_size);
#   endif

    write_32bit_mmio_register(&LPC_FIFO->usart[uart_index].TXDAT, c);
}

#pragma GCC diagnostic push

#ifndef _RELIABILITY_CHECKS_
#pragma GCC diagnostic ignored "-Wunused-variable"
#endif

/**
 * Receive a character from a UART serial port, blocking the caller
 * if there are no characters to read
 */
uint8_t
uart_getchar(
    _IN_ const struct uart_device *uart_device_p)
{
    struct uart_device_var *const uart_var_p = uart_device_p->urt_var_p;
    uint_fast8_t uart_index = uart_device_p - g_uart_devices;
    uint32_t reg_value;
    uint8_t char_received;

    DBG_ASSERT(
        uart_var_p->urt_initialized, uart_var_p, uart_device_p);

    DBG_ASSERT_PRIVILEGED_CPU_MODE_AND_INTERRUPTS_ENABLED();

    /*
     * Enable generation of receive interrupts, if necessary:
     */
    reg_value = read_32bit_mmio_register(&LPC_FIFO->usart[uart_index].CTLSET);
    if ((reg_value & FIFO_UART_CTL_RXTHINTEN_MASK) == 0) {
        reg_value |= FIFO_UART_CTL_RXTHINTEN_MASK;
        write_32bit_mmio_register(&LPC_FIFO->usart[uart_index].CTLSET, reg_value);
    }

    bool entry_read = rtos_k_byte_circular_buffer_read(
			&uart_var_p->urt_receive_queue,
			&char_received,
			true, 0);

    FDC_ASSERT(entry_read, uart_device_p, 0);

    return char_received;
}

#pragma GCC diagnostic pop

/**
 * Reads the next character received from a UART serial port, doing polling
 * until the character is received.
 */
uint8_t
uart_getchar_with_polling(
    _IN_ const struct uart_device *uart_device_p)
{
    uint32_t reg_value;
    uint_fast8_t uart_index = uart_device_p - g_uart_devices;

#   ifdef _RELIABILITY_CHECKS_
    struct uart_device_var *const uart_var_p = uart_device_p->urt_var_p;

    FDC_ASSERT(
        uart_var_p->urt_initialized, uart_var_p, uart_device_p);
#   endif

    /*
     * Disable generation of receive interrupts:
     */
    write_32bit_mmio_register(
        &LPC_FIFO->usart[uart_index].CTLCLR,
        FIFO_UART_CTL_RXTHINTEN_MASK);

    /*
     * Do polling until the UART's receive FIFO is not empty:
     */
try_again:
    for ( ; ; ) {
        reg_value = read_32bit_mmio_register(&LPC_FIFO->usart[uart_index].STAT);
        if ((reg_value & FIFO_UART_STAT_RXEMPTY_MASK) == 0) {
            break;
        }
    }

#   ifdef DEBUG
    uint_fast8_t rx_fifo_length =
        GET_BIT_FIELD(reg_value,
                      FIFO_UART_STAT_RXCOUNT_MASK,
                      FIFO_UART_STAT_RXCOUNT_SHIFT);

        DBG_ASSERT(rx_fifo_length > 0 &&
                   rx_fifo_length <= uart_var_p->urt_rx_fifo_size,
                   rx_fifo_length, uart_var_p->urt_rx_fifo_size);
#   endif

    reg_value =
        read_32bit_mmio_register(&LPC_FIFO->usart[uart_index].RXDATSTAT);

    if (reg_value & (FIFO_UART_RXDATSTAT_FRAMERR_MASK |
                     FIFO_UART_RXDATSTAT_PARITYERR_MASK |
                     FIFO_UART_RXDATSTAT_RXNOISE_MASK)) {
        CAPTURE_FDC_ERROR("UART receive error", reg_value, uart_index);
        goto try_again;
    }

    uint_fast8_t byte_received =
        GET_BIT_FIELD(reg_value, FIFO_UART_RXDATSTAT_RXDAT_MASK,
                      FIFO_UART_RXDATSTAT_RXDAT_SHIFT);

    return byte_received;
}


void
assert_interrupt_source_is_set(interrupt_channel_t interrupt_channel)
{
    FDC_ASSERT(
        interrupt_channel < SOC_NUM_INTERRUPT_CHANNELS,
        interrupt_channel, SOC_NUM_INTERRUPT_CHANNELS);

    FDC_ASSERT(
        NVIC_GetPendingIRQ(interrupt_channel) != 0,
        interrupt_channel, 0);
}


/**
 * Notify interrupt controller that processing for the last interrupt received
 * by the calling CPU core has been completed, so that another interrupt of
 * the same priority or lower can be received by this CPU core
 */
void
notify_interrupt_controller_isr_done(interrupt_channel_t interrupt_channel)
{
    DBG_ASSERT(
        interrupt_channel >= -1 && interrupt_channel < SOC_NUM_INTERRUPT_CHANNELS,
        interrupt_channel, SOC_NUM_INTERRUPT_CHANNELS);
}


/*
 * Generate dummy NVIC interrupt handler functions
 */
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_wdt_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_WDT_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_bod_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_BOD_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_reserved0_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_Reserved0_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_dma_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_DMA_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_gint0_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_GINT0_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_pin_int0_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_PIN_INT0_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_pin_int1_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_PIN_INT1_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_pin_int2_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_PIN_INT2_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_pin_int3_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_PIN_INT3_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_utick_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_UTICK_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_mrt_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_MRT_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_ct32b0_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_CT32B0_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_ct32b1_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_CT32B1_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_ct32b2_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_CT32B2_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_ct32b3_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_CT32B3_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_ct32b4_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_CT32B4_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_sct0_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_SCT0_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_uart1_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_UART1_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_uart2_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_UART2_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_uart3_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_UART3_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_i2c0_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_I2C0_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_i2c1_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_I2C1_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_i2c2_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_I2C2_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_spi0_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_SPI0_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_spi1_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_SPI1_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_adc_seqa_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_ADC_SEQA_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_adc_seqb_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_ADC_SEQB_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_adc_thcmp_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_ADC_THCMP_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_rtc_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_RTC_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_reserved1_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_Reserved1_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_mailbox_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_MAILBOX_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_int_gint1_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_GINT1_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_pin_int4_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_PIN_INT4_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_pin_int5_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_PIN_INT5_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_pin_int6_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_PIN_INT6_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_pin_int7_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_PIN_INT7_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_spi2_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_SPI2_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_spi3_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_SPI3_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_reserved2_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_Reserved2_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_rit_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_RIT_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_reserved3_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_Reserved3_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_reserved4_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_Reserved4_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_reserved5_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_Reserved5_IRQ))
GENERATE_DUMMY_NVIC_ISR_FUNCTION(dummy_reserved6_irq_isr, VECTOR_NUMBER_TO_IRQ_NUMBER(INT_Reserved6_IRQ))

/**
 * Generate function that reads from an MMIO register of the given bit width
 */
#define GEN_READ_MMIO_REGISTER_FUNCTION(_func_name, _reg_type, _value_type) \
    _value_type                                                         \
    _func_name(const volatile _reg_type *io_reg_p)                      \
    {                                                                   \
        FDC_ASSERT_VALID_MMIO_ADDRESS(io_reg_p);                        \
        return *io_reg_p;                                               \
    }

/**
 * Generate function that writes to an MMIO register of the given bit width
 */
#define GEN_WRITE_MMIO_REGISTER_FUNCTION(_func_name, _reg_type, _value_type) \
    void                                                                \
    _func_name(volatile _reg_type *io_reg_p, _value_type value)         \
    {                                                                   \
        FDC_ASSERT_VALID_MMIO_ADDRESS(io_reg_p);                        \
        *io_reg_p = value;                                              \
    }

GEN_READ_MMIO_REGISTER_FUNCTION(read_32bit_mmio_register, uint32_t, uint32_t)

GEN_WRITE_MMIO_REGISTER_FUNCTION(write_32bit_mmio_register, uint32_t, uint32_t)

GEN_READ_MMIO_REGISTER_FUNCTION(read_16bit_mmio_register, uint16_t, uint16_t)

GEN_WRITE_MMIO_REGISTER_FUNCTION(write_16bit_mmio_register, uint16_t, uint16_t)

GEN_READ_MMIO_REGISTER_FUNCTION(read_8bit_mmio_register, uint8_t, uint8_t)

GEN_WRITE_MMIO_REGISTER_FUNCTION(write_8bit_mmio_register, uint8_t, uint8_t)

